; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v7)
             (pred_3 ?v10 ?v5)
             (pred_12 ?v11 ?v5)
             (pred_6 ?v2 ?v11 )
	     (pred_8 ?v11)
             (pred_10 ?v9)
             (pred_9 ?v10)
             (pred_4 ?v5)
             (pred_5 ?v11)
             (pred_1 ?v10)
             (pred_2 ?v11)
             (pred_11 ))



(:action op_4
:parameters (?v13 ?v12 ?v6 ?v4)
:precondition (and (pred_10 ?v13) (pred_10 ?v12) (pred_9 ?v6) (pred_4 ?v4)
          (pred_7 ?v13 ?v12) (pred_3 ?v6 ?v4)
                   (pred_12 ?v12 ?v4) (pred_8 ?v13) 
                   (pred_5 ?v12) (pred_1 ?v6))
:effect (and  (pred_2 ?v12) (not (pred_5 ?v12))))


(:action op_3
:parameters (?v13 ?v1)
:precondition (and (pred_10 ?v13) (pred_10 ?v1)
               (pred_8 ?v13) (pred_7 ?v13 ?v1) (pred_2 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_10 ?v13) (pred_9 ?v6) 
                  (pred_8 ?v13) (pred_6 ?v6 ?v13) (pred_11 ))
:effect (and (pred_1 ?v6)
   (not (pred_6 ?v6 ?v13)) (not (pred_11 ))))


(:action op_2
:parameters (?v13 ?v3 ?v8)
:precondition (and (pred_10 ?v13) (pred_9 ?v3) (pred_9 ?v8)
                  (pred_8 ?v13) (pred_1 ?v8) (pred_6 ?v3 ?v13))
:effect (and (pred_1 ?v3) (pred_6 ?v8 ?v13)
        (not (pred_1 ?v8)) (not (pred_6 ?v3 ?v13))))

(:action op_5
:parameters (?v13 ?v6)
:precondition (and (pred_10 ?v13) (pred_9 ?v6) 
                  (pred_8 ?v13) (pred_1 ?v6))
:effect (and (pred_11 ) (pred_6 ?v6 ?v13) (not (pred_1 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_29 obj_24 obj_14 obj_28 obj_09 obj_06 obj_22 obj_01 obj_05 obj_20 obj_32 obj_02 obj_10 obj_15 obj_03 obj_04 obj_12 obj_08 obj_23 obj_30 obj_18 obj_19 obj_26 obj_31 obj_17
    obj_07 obj_27 obj_11
    obj_21 obj_25 obj_13 obj_16
    )

    (:init
       (pred_11)

       (pred_10 obj_29)
       (pred_10 obj_24)
       (pred_10 obj_14)
       (pred_10 obj_28)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_32)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_23)
       (pred_10 obj_30)
       (pred_10 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_26)
       (pred_10 obj_31)
       (pred_10 obj_17)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_11)
       (pred_9 obj_21)
       (pred_9 obj_25)
       (pred_9 obj_13)
       (pred_9 obj_16)

       (pred_7 obj_29 obj_06)
       (pred_7 obj_29 obj_24)
       (pred_7 obj_24 obj_22)
       (pred_7 obj_24 obj_14)
       (pred_7 obj_24 obj_29)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_28)
       (pred_7 obj_14 obj_24)
       (pred_7 obj_28 obj_05)
       (pred_7 obj_28 obj_09)
       (pred_7 obj_28 obj_14)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_28)
       (pred_7 obj_06 obj_32)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_06 obj_29)
       (pred_7 obj_22 obj_02)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_01 obj_10)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_28)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_32 obj_04)
       (pred_7 obj_32 obj_02)
       (pred_7 obj_32 obj_06)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_10)
       (pred_7 obj_02 obj_22)
       (pred_7 obj_02 obj_32)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_01)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_15 obj_23)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_32)
       (pred_7 obj_12 obj_19)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_08 obj_26)
       (pred_7 obj_08 obj_23)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_23 obj_31)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_23 obj_15)
       (pred_7 obj_23 obj_08)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_19 obj_12)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_26 obj_31)
       (pred_7 obj_26 obj_08)
       (pred_7 obj_26 obj_19)
       (pred_7 obj_31 obj_17)
       (pred_7 obj_31 obj_23)
       (pred_7 obj_31 obj_26)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_17 obj_31)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_28)
       (pred_5 obj_09)
       (pred_12  obj_05 obj_07)
       (pred_12  obj_30 obj_27)
       (pred_12  obj_28 obj_11)
       (pred_12  obj_09 obj_11)
       (pred_2 obj_29)
       (pred_2 obj_24)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_22)
       (pred_2 obj_01)
       (pred_2 obj_20)
       (pred_2 obj_32)
       (pred_2 obj_02)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_23)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_26)
       (pred_2 obj_31)
       (pred_2 obj_17)

       (pred_3  obj_21 obj_07)
       (pred_3  obj_25 obj_27)
       (pred_3  obj_13 obj_11)
       (pred_3  obj_16 obj_11)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_25 obj_22)
       (pred_6 obj_13 obj_31)
       (pred_6 obj_16 obj_14)
       (pred_8 obj_23)
    )

    (:goal (and
       (pred_6 obj_16 obj_23)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_3 obj_23 obj_08)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_01)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_01)
   goals met: 0 of 1
4. (op_3 obj_01 obj_14)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_14)
   goals met: 0 of 1
5. (op_1 obj_14 obj_16)
   deleted: (pred_6 obj_16 obj_14) (pred_11)
   added: (pred_1 obj_16)
   goals met: 0 of 1
6. (op_3 obj_14 obj_01)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_01)
   goals met: 0 of 1
7. (op_3 obj_01 obj_10)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_08)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_08)
   goals met: 0 of 1
9. (op_3 obj_08 obj_23)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_23)
   goals met: 0 of 1
10. (op_5 obj_23 obj_16)
   deleted: (pred_1 obj_16)
   added: (pred_11) (pred_6 obj_16 obj_23)
   goals met: 1 of 1
